MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX460F512L.PIC
      <edc:AdjustPoint edc:_addr="0x1F881130" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F881140" edc:_begin="0x140" edc:_end="0x150" edc:_modsrc="DOS-00868_YPAA_int_evic.Module" edc:_refcount="4" edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC11" edc:desc="" edc:grp="INT" edc:impl="0xe0e0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="IPC11" edc:nzwidth="0x20" edc:por="-------------------00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FCEIS" edc:desc="" edc:mask="0x3" edc:name="FCEIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FCEIP" edc:desc="" edc:mask="0x7" edc:name="FCEIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USBIS" edc:desc="" edc:mask="0x3" edc:name="USBIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="USBIP" edc:desc="" edc:mask="0x7" edc:name="USBIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F881150" edc:offset="3760"/>
      <edc:SFRDef edc:_addr="0x1F882000" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-00747_bus_matrix_bvci_v1.Module" edc:_refcount="1" edc:access="-----n-----nnnnn---------n---nnn" edc:cname="BMXCON" edc:desc="" edc:grp="BMX" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0-----11111---------1---001" edc:name="BMXCON" edc:nzwidth="0x20" edc:por="-----0-----11111---------1---001" edc:portals="CLR SET INV" ltx:baseofperipheral="BMX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BMXARB" edc:desc="" edc:mask="0x7" edc:name="BMXARB" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="BMXWSDRM" edc:desc="" edc:mask="0x1" edc:name="BMXWSDRM" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="BMXERRIS" edc:desc="" edc:mask="0x1" edc:name="BMXERRIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BMXERRDS" edc:desc="" edc:mask="0x1" edc:name="BMXERRDS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BMXERRDMA" edc:desc="" edc:mask="0x1" edc:name="BMXERRDMA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BMXERRICD" edc:desc="" edc:mask="0x1" edc:name="BMXERRICD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BMXERRIXI" edc:desc="" edc:mask="0x1" edc:name="BMXERRIXI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="BMXCHEDMA" edc:desc="" edc:mask="0x1" edc:name="BMXCHEDMA" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882010" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-00747_bus_matrix_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BMXDKPBA" edc:desc="" edc:grp="BMX" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BMXDKPBA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="BMX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BMXDKPBA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="BMXDKPBA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882020" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-00747_bus_matrix_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BMXDUDBA" edc:desc="" edc:grp="BMX" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BMXDUDBA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="BMX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BMXDUDBA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="BMXDUDBA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882030" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-00747_bus_matrix_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BMXDUPBA" edc:desc="" edc:grp="BMX" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BMXDUPBA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="BMX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BMXDUPBA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="BMXDUPBA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882040" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-00747_bus_matrix_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BMXDRMSZ" edc:desc="" edc:grp="BMX" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000100000000000000000" edc:name="BMXDRMSZ" edc:nzwidth="0x20" edc:por="00000000000000100000000000000000" edc:portals="- - -" ltx:memberofperipheral="BMX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BMXDRMSZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="BMXDRMSZ" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882050" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-00747_bus_matrix_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BMXPUPBA" edc:desc="" edc:grp="BMX" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BMXPUPBA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="BMX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BMXPUPBA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="BMXPUPBA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882060" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-00747_bus_matrix_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BMXPFMSZ" edc:desc="" edc:grp="BMX" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000010000000000000000000" edc:name="BMXPFMSZ" edc:nzwidth="0x20" edc:por="00000000000010000000000000000000" edc:portals="- - -" ltx:memberofperipheral="BMX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BMXPFMSZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="BMXPFMSZ" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882070" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-00747_bus_matrix_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BMXBOOTSZ" edc:desc="" edc:grp="BMX" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000011000000000000" edc:name="BMXBOOTSZ" edc:nzwidth="0x20" edc:por="00000000000000000011000000000000" edc:portals="- - -" ltx:memberofperipheral="BMX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BMXBOOTSZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="BMXBOOTSZ" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F882080" edc:offset="3968"/>
      <edc:SFRDef edc:_addr="0x1F883000" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1a.Module" edc:_refcount="1" edc:access="----------------n-nn------------" edc:cname="DMACON" edc:desc="" edc:grp="DMAC" edc:impl="0xfffff7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00x0------------" edc:name="DMACON" edc:nzwidth="0x20" edc:por="----------------00x0------------" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:desc="" edc:mask="0x1" edc:name="SUSPEND" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="DMA" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883010" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1a.Module" edc:_refcount="1" edc:access="----------------------------n-nn" edc:cname="DMASTAT" edc:desc="" edc:grp="DMAC" edc:impl="0xfffffffb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0-xx" edc:name="DMASTAT" edc:nzwidth="0x20" edc:por="----------------------------0-xx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACH" edc:desc="" edc:mask="0x3" edc:name="DMACH" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RDWR" edc:desc="" edc:mask="0x1" edc:name="RDWR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883020" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1a.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMAADDR" edc:desc="" edc:grp="DMAC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DMAADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
